Revit 2027 API
ColorFillScheme.IsValidParameterDefinitionId Method
 Checks whether the input parameter id can be applied to the scheme.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidParameterDefinitionId(
	ElementId parameterId
)
Public Function IsValidParameterDefinitionId (
	parameterId As ElementId
) As Boolean
public:
bool IsValidParameterDefinitionId(
	ElementId^ parameterId
)
member IsValidParameterDefinitionId :
        parameterId : ElementId -> bool
Parameters
parameterId ElementId
Return Value
Boolean
 Returns true if the input parameter id can be set to this scheme, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace